output/ignite-e-10-1000Mbps-3ms-1000-20000-4-load-1.out
[10:23:53][INFO ][Thread-5] Start Ignite client node.
[10:23:53][INFO ][Thread-5] 

>>>    __________  ________________  
>>>   /  _/ ___/ |/ /  _/_  __/ __/  
>>>  _/ // (7 7    // /  / / / _/    
>>> /___/\___/_/|_/___/ /_/ /___/   
>>> 
>>> ver. 2.7.0#20181130-sha1:256ae401
>>> 2018 Copyright(C) Apache Software Foundation
>>> 
>>> Ignite documentation: http://ignite.apache.org

[10:23:53][INFO ][Thread-5] Config URL: n/a
[10:23:53][INFO ][Thread-5] IgniteConfiguration [igniteInstanceName=YCSB client node, pubPoolSize=12, svcPoolSize=12, callbackPoolSize=12, stripedPoolSize=12, sysPoolSize=12, mgmtPoolSize=4, igfsPoolSize=12, dataStreamerPoolSize=12, utilityCachePoolSize=12, utilityCacheKeepAliveTime=60000, p2pPoolSize=2, qryPoolSize=12, igniteHome=null, igniteWorkDir=/tmp/ignite/work, mbeanSrv=com.sun.jmx.mbeanserver.JmxMBeanServer@710726a3, nodeId=c3c868eb-dd76-4db2-a38e-8bbe5b3a22f3, marsh=BinaryMarshaller [], marshLocJobs=false, daemon=false, p2pEnabled=false, netTimeout=2000, sndRetryDelay=1000, sndRetryCnt=3, metricsHistSize=10000, metricsUpdateFreq=2000, metricsExpTime=9223372036854775807, discoSpi=TcpDiscoverySpi [addrRslvr=null, sockTimeout=0, ackTimeout=0, marsh=null, reconCnt=10, reconDelay=2000, maxAckTimeout=600000, forceSrvMode=false, clientReconnectDisabled=false, internalLsnr=null], segPlc=STOP, segResolveAttempts=2, waitForSegOnStart=true, allResolversPassReq=true, segChkFreq=10000, commSpi=TcpCommunicationSpi [connectGate=null, connPlc=org.apache.ignite.spi.communication.tcp.TcpCommunicationSpi$FirstConnectionPolicy@2dc72d08, enableForcibleNodeKill=false, enableTroubleshootingLog=false, locAddr=null, locHost=null, locPort=47100, locPortRange=100, shmemPort=-1, directBuf=true, directSndBuf=false, idleConnTimeout=600000, connTimeout=5000, maxConnTimeout=600000, reconCnt=10, sockSndBuf=32768, sockRcvBuf=32768, msgQueueLimit=0, slowClientQueueLimit=0, nioSrvr=null, shmemSrv=null, usePairedConnections=false, connectionsPerNode=1, tcpNoDelay=true, filterReachableAddresses=false, ackSndThreshold=32, unackedMsgsBufSize=0, sockWriteTimeout=2000, boundTcpPort=-1, boundTcpShmemPort=-1, selectorsCnt=6, selectorSpins=0, addrRslvr=null, ctxInitLatch=java.util.concurrent.CountDownLatch@6140ca7[Count = 1], stopping=false], evtSpi=org.apache.ignite.spi.eventstorage.NoopEventStorageSpi@764fdacc, colSpi=NoopCollisionSpi [], deploySpi=LocalDeploymentSpi [], indexingSpi=org.apache.ignite.spi.indexing.noop.NoopIndexingSpi@3f079762, addrRslvr=null, encryptionSpi=org.apache.ignite.spi.encryption.noop.NoopEncryptionSpi@7798da11, clientMode=true, rebalanceThreadPoolSize=1, txCfg=TransactionConfiguration [txSerEnabled=false, dfltIsolation=REPEATABLE_READ, dfltConcurrency=PESSIMISTIC, dfltTxTimeout=0, txTimeoutOnPartitionMapExchange=0, pessimisticTxLogSize=0, pessimisticTxLogLinger=10000, tmLookupClsName=null, txManagerFactory=null, useJtaSync=false], cacheSanityCheckEnabled=true, discoStartupDelay=60000, deployMode=SHARED, p2pMissedCacheSize=100, locHost=null, timeSrvPortBase=31100, timeSrvPortRange=100, failureDetectionTimeout=10000, sysWorkerBlockedTimeout=null, clientFailureDetectionTimeout=30000, metricsLogFreq=60000, hadoopCfg=null, connectorCfg=ConnectorConfiguration [jettyPath=null, host=null, port=11211, noDelay=true, directBuf=false, sndBufSize=32768, rcvBufSize=32768, idleQryCurTimeout=600000, idleQryCurCheckFreq=60000, sndQueueLimit=0, selectorCnt=4, idleTimeout=7000, sslEnabled=false, sslClientAuth=false, sslCtxFactory=null, sslFactory=null, portRange=100, threadPoolSize=12, msgInterceptor=null], odbcCfg=null, warmupClos=null, atomicCfg=AtomicConfiguration [seqReserveSize=1000, cacheMode=PARTITIONED, backups=1, aff=null, grpName=null], classLdr=null, sslCtxFactory=null, platformCfg=null, binaryCfg=null, memCfg=null, pstCfg=null, dsCfg=null, activeOnStart=true, autoActivation=true, longQryWarnTimeout=3000, sqlConnCfg=null, cliConnCfg=ClientConnectorConfiguration [host=null, port=10800, portRange=100, sockSndBufSize=0, sockRcvBufSize=0, tcpNoDelay=true, maxOpenCursorsPerConn=128, threadPoolSize=12, idleTimeout=0, jdbcEnabled=true, odbcEnabled=true, thinCliEnabled=true, sslEnabled=false, useIgniteSslCtxFactory=true, sslClientAuth=false, sslCtxFactory=null], mvccVacuumThreadCnt=2, mvccVacuumFreq=5000, authEnabled=false, failureHnd=null, commFailureRslvr=null]
[10:23:53][INFO ][Thread-5] Daemon mode: off
[10:23:53][INFO ][Thread-5] OS: Linux 4.9.0-11-amd64 amd64
[10:23:53][INFO ][Thread-5] OS user: root
[10:23:53][INFO ][Thread-5] PID: 860
[10:23:53][INFO ][Thread-5] Language runtime: Java Platform API Specification ver. 1.8
[10:23:53][INFO ][Thread-5] VM information: OpenJDK Runtime Environment 1.8.0_282-b08 Oracle Corporation OpenJDK 64-Bit Server VM 25.282-b08
[10:23:53][INFO ][Thread-5] VM total memory: 14.0GB
[10:23:53][INFO ][Thread-5] Remote Management [restart: off, REST: off, JMX (remote: off)]
[10:23:53][INFO ][Thread-5] Logger: Log4J2Logger [quiet=false, config=file:/opt/ycsb-0.17.0/ignite-binding/lib/ignite-binding-0.17.0.jar!/log4j2.xml]
[10:23:53][INFO ][Thread-5] IGNITE_HOME=null
[10:23:53][INFO ][Thread-5] VM arguments: []
[10:23:53][INFO ][Thread-5] Configured caches [in 'sysMemPlc' dataRegion: ['ignite-sys-cache']]
[10:23:53][WARN ][Thread-5] Please set system property '-Djava.net.preferIPv4Stack=true' to avoid possible problems in mixed environments.
[10:23:53][INFO ][Thread-5] Configured plugins:
[10:23:53][INFO ][Thread-5]   ^-- None
[10:23:53][INFO ][Thread-5] 
[10:23:53][INFO ][Thread-5] Configured failure handler: [hnd=StopNodeOrHaltFailureHandler [tryStop=false, timeout=0, super=AbstractFailureHandler [ignoredFailureTypes=[SYSTEM_WORKER_BLOCKED]]]]
[10:23:53][INFO ][Thread-5] Successfully bound communication NIO server to TCP port [port=47100, locHost=0.0.0.0/0.0.0.0, selectorsCnt=6, selectorSpins=0, pairedConn=false]
[10:23:53][WARN ][Thread-5] Message queue limit is set to 0 which may lead to potential OOMEs when running cache operations in FULL_ASYNC or PRIMARY_SYNC modes due to message queues growth on sender and receiver sides.
[10:23:53][WARN ][Thread-5] Checkpoints are disabled (to enable configure any GridCheckpointSpi implementation)
[10:23:53][WARN ][Thread-5] Collision resolution is disabled (all jobs will be activated upon arrival).
[10:23:53][INFO ][Thread-5] Security status [authentication=off, tls/ssl=off]
[10:23:53][INFO ][Thread-5] Evict partition permits=3
[10:23:54][INFO ][Thread-5] Client connector processor has started on TCP port 10800
[10:23:54][INFO ][Thread-5] REST protocols do not start on client node. To start the protocols on client node set '-DIGNITE_REST_START_ON_CLIENT=true' system property.
[10:23:54][INFO ][Thread-5] Non-loopback local IPs: 192.168.224.4
[10:23:54][INFO ][Thread-5] Enabled local MACs: 0242C0A8E004
[10:23:54][INFO ][disco-notifier-worker-#46%YCSB client node%] Assigned mvcc coordinator [crd=MvccCoordinator [nodeId=42b241cb-b3a0-4012-8118-d002f1344bdb, crdVer=1614075455583, topVer=AffinityTopologyVersion [topVer=27, minorTopVer=0]], crdNode=TcpDiscoveryNode [id=42b241cb-b3a0-4012-8118-d002f1344bdb, addrs=[127.0.0.1, 192.168.224.11], sockAddrs=[/127.0.0.1:47500, 56a9f5eb31cf/192.168.224.11:47500], discPort=47500, order=1, intOrder=1, lastExchangeTime=1614075834499, loc=false, ver=2.7.0#20181130-sha1:256ae401, isClient=false]]
[10:23:54][INFO ][exchange-worker-#48%YCSB client node%] Started exchange init [topVer=AffinityTopologyVersion [topVer=27, minorTopVer=0], mvccCrd=MvccCoordinator [nodeId=42b241cb-b3a0-4012-8118-d002f1344bdb, crdVer=1614075455583, topVer=AffinityTopologyVersion [topVer=27, minorTopVer=0]], mvccCrdChange=true, crd=false, evt=NODE_JOINED, evtNode=c3c868eb-dd76-4db2-a38e-8bbe5b3a22f3, customEvt=null, allowMerge=true]
[10:23:54][INFO ][exchange-worker-#48%YCSB client node%] Components activation performed in 0 ms.
[10:23:54][INFO ][exchange-worker-#48%YCSB client node%] Started cache [name=ignite-sys-cache, id=-2100569601, memoryPolicyName=sysMemPlc, mode=REPLICATED, atomicity=TRANSACTIONAL, backups=2147483647, mvcc=false], encryptionEnabled=false]
[10:23:54][INFO ][exchange-worker-#48%YCSB client node%] Starting caches on local join performed in 173 ms.
[10:23:54][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.224.4:34532, rmtAddr=56a9f5eb31cf/192.168.224.11:47100]
[10:23:54][INFO ][exchange-worker-#48%YCSB client node%] Sending Single Message performed in 28 ms.
[10:23:54][INFO ][exchange-worker-#48%YCSB client node%] Finished exchange init [topVer=AffinityTopologyVersion [topVer=27, minorTopVer=0], crd=false]
[10:23:55][INFO ][sys-#49%YCSB client node%] Received full message, will finish exchange [node=42b241cb-b3a0-4012-8118-d002f1344bdb, resVer=AffinityTopologyVersion [topVer=27, minorTopVer=0]]
[10:23:55][INFO ][sys-#49%YCSB client node%] Affinity initialization on local join performed in 11 ms.
[10:23:55][INFO ][sys-#49%YCSB client node%] Affinity changes applied in 11 ms.
[10:23:55][INFO ][sys-#49%YCSB client node%] Full map updating for 2 groups performed in 3 ms.
[10:23:55][INFO ][sys-#49%YCSB client node%] Finish exchange future [startVer=AffinityTopologyVersion [topVer=27, minorTopVer=0], resVer=AffinityTopologyVersion [topVer=27, minorTopVer=0], err=null]
[10:23:55][INFO ][sys-#49%YCSB client node%] Finish proxy initialization, cacheName=ignite-sys-cache, localNodeId=c3c868eb-dd76-4db2-a38e-8bbe5b3a22f3
[10:23:55][INFO ][sys-#49%YCSB client node%] Completed partition exchange [localNode=c3c868eb-dd76-4db2-a38e-8bbe5b3a22f3, exchange=GridDhtPartitionsExchangeFuture [topVer=AffinityTopologyVersion [topVer=27, minorTopVer=0], evt=NODE_JOINED, evtNode=TcpDiscoveryNode [id=c3c868eb-dd76-4db2-a38e-8bbe5b3a22f3, addrs=[127.0.0.1, 192.168.224.4], sockAddrs=[a176e600edf0/192.168.224.4:0, /127.0.0.1:0], discPort=0, order=27, intOrder=0, lastExchangeTime=1614075834398, loc=true, ver=2.7.0#20181130-sha1:256ae401, isClient=true], done=true], topVer=AffinityTopologyVersion [topVer=27, minorTopVer=0], durationFromInit=303]
[10:23:55][INFO ][exchange-worker-#48%YCSB client node%] Skipping rebalancing (no affinity changes) [top=AffinityTopologyVersion [topVer=27, minorTopVer=0], rebTopVer=AffinityTopologyVersion [topVer=-1, minorTopVer=0], evt=NODE_JOINED, evtNode=c3c868eb-dd76-4db2-a38e-8bbe5b3a22f3, client=true]
[10:23:55][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.224.4:58474, rmtAddr=507dfa5ff0a6/192.168.224.6:47100]
[10:23:55][INFO ][Thread-5] Performance suggestions for grid 'YCSB client node' (fix if possible)
[10:23:55][INFO ][Thread-5] To disable, set -DIGNITE_PERFORMANCE_SUGGESTIONS_DISABLED=true
[10:23:55][INFO ][Thread-5]   ^-- Enable G1 Garbage Collector (add '-XX:+UseG1GC' to JVM options)
[10:23:55][INFO ][Thread-5]   ^-- Specify JVM heap max size (add '-Xmx<size>[g|G|m|M|k|K]' to JVM options)
[10:23:55][INFO ][Thread-5]   ^-- Set max direct memory size if getting 'OOME: Direct buffer memory' (add '-XX:MaxDirectMemorySize=<size>[g|G|m|M|k|K]' to JVM options)
[10:23:55][INFO ][Thread-5]   ^-- Disable processing of calls to System.gc() (add '-XX:+DisableExplicitGC' to JVM options)
[10:23:55][INFO ][Thread-5] Refer to this page for more performance suggestions: https://apacheignite.readme.io/docs/jvm-and-system-tuning
[10:23:55][INFO ][Thread-5] 
[10:23:55][INFO ][Thread-5] To start Console Management & Monitoring run ignitevisorcmd.{sh|bat}
[10:23:55][INFO ][Thread-5] 

>>> +----------------------------------------------------------------------+
>>> Ignite ver. 2.7.0#20181130-sha1:256ae4012cb143b4855b598b740a6f3499ead4db
>>> +----------------------------------------------------------------------+
>>> OS name: Linux 4.9.0-11-amd64 amd64
>>> CPU(s): 12
>>> Heap: 14.0GB
>>> VM name: 860@a176e600edf0
>>> Ignite instance name: YCSB client node
>>> Local node [ID=C3C868EB-DD76-4DB2-A38E-8BBE5B3A22F3, order=27, clientMode=true]
>>> Local node addresses: [a176e600edf0/127.0.0.1, /192.168.224.4]
>>> Local ports: TCP:10800 TCP:47100 

[10:23:55][INFO ][Thread-5] Topology snapshot [ver=27, locNode=c3c868eb, servers=10, clients=1, state=ACTIVE, CPUs=132, offheap=130.0GB, heap=24.0GB]
[10:23:55][INFO ][Thread-5] Activate Ignite cluster.
[10:23:55][INFO ][Thread-5] Sending activate request from node [id=c3c868eb-dd76-4db2-a38e-8bbe5b3a22f3, topVer=AffinityTopologyVersion [topVer=27, minorTopVer=0], client=true, daemon=false]
[10:23:55][INFO ][exchange-worker-#48%YCSB client node%] Started cache [name=usertable, id=358348515, memoryPolicyName=null, mode=PARTITIONED, atomicity=ATOMIC, backups=1, mvcc=false], encryptionEnabled=false]
[10:23:55][INFO ][grid-nio-worker-tcp-comm-2-#34%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.224.4:32878, rmtAddr=59a8be677c5c/192.168.224.10:47100]
[10:23:55][INFO ][exchange-worker-#48%YCSB client node%] Finish proxy initialization, cacheName=usertable, localNodeId=c3c868eb-dd76-4db2-a38e-8bbe5b3a22f3
[10:23:55][INFO ][grid-nio-worker-tcp-comm-3-#35%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.224.4:46572, rmtAddr=77a348b39010/192.168.224.3:47100]
[10:23:55][INFO ][grid-nio-worker-tcp-comm-4-#36%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.224.4:60522, rmtAddr=278778518f00/192.168.224.2:47100]
[10:23:55][INFO ][grid-nio-worker-tcp-comm-5-#37%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.224.4:60194, rmtAddr=4a1a1ef7293c/192.168.224.12:47100]
[10:23:55][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Accepted incoming communication connection [locAddr=/192.168.224.4:47100, rmtAddr=/192.168.224.5:55690]
[10:23:55][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Accepted incoming communication connection [locAddr=/192.168.224.4:47100, rmtAddr=/192.168.224.8:52544]
[10:23:55][INFO ][grid-nio-worker-tcp-comm-2-#34%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.224.4:45476, rmtAddr=f71c67fa6b2f/192.168.224.9:47100]
[10:23:55][INFO ][grid-nio-worker-tcp-comm-3-#35%YCSB client node%] Accepted incoming communication connection [locAddr=/192.168.224.4:47100, rmtAddr=/192.168.224.7:46756]
[10:24:04][WARN ][ignite-update-notifier-timer] New version is available at ignite.apache.org: 2.9.1
[10:24:29][INFO ][Thread-5] Stopped cache [cacheName=ignite-sys-cache]
[10:24:29][INFO ][Thread-5] Stopped cache [cacheName=usertable]
[10:24:29][INFO ][Thread-5] 

>>> +---------------------------------------------------------------------------------+
>>> Ignite ver. 2.7.0#20181130-sha1:256ae4012cb143b4855b598b740a6f3499ead4db stopped OK
>>> +---------------------------------------------------------------------------------+
>>> Ignite instance name: YCSB client node
>>> Grid uptime: 00:00:34.437


[OVERALL], RunTime(ms), 36663
[OVERALL], Throughput(ops/sec), 545.5090963641819
[TOTAL_GCS_PS_Scavenge], Count, 4
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 31
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0845539099364482
[TOTAL_GCS_PS_MarkSweep], Count, 2
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 69
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.18820063824564276
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 100
[TOTAL_GC_TIME_%], Time(%), 0.27275454818209094
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 22543.5
[CLEANUP], MinLatency(us), 6
[CLEANUP], MaxLatency(us), 90175
[CLEANUP], 95thPercentileLatency(us), 90175
[CLEANUP], 99thPercentileLatency(us), 90175
[INSERT], Operations, 20000
[INSERT], AverageLatency(us), 6767.9763
[INSERT], MinLatency(us), 6468
[INSERT], MaxLatency(us), 62815
[INSERT], 95thPercentileLatency(us), 6987
[INSERT], 99thPercentileLatency(us), 7531
[INSERT], Return=OK, 20000